#### 📖 Terraform Plan ('infra/resources/prod') - failure
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform planned the following actions, but then encountered a problem:

  # module.web_apps.azurerm_role_assignment.eventhub_namespace_write will be created
  + resource "azurerm_role_assignment" "eventhub_namespace_write" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "42a26240-ee65-4929-889d-f5fd6cafbe85"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Azure Event Hubs Data Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.EventHub/namespaces/io-p-itn-com-etl-evhns-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.key_vault_etl_func_secrets_user will be created
  + resource "azurerm_role_assignment" "key_vault_etl_func_secrets_user" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "42a26240-ee65-4929-889d-f5fd6cafbe85"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.KeyVault/vaults/io-p-kv-common"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01"
        name                                           = "io-p-itn-msgs-sending-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
            # (26 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.functions_messages_sending.module.function_app_messages_sending.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-msgs-rg-01/providers/Microsoft.Web/sites/io-p-itn-msgs-sending-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                = (sensitive value) -> null
          ~ health_check_eviction_time_in_min       = 0 -> 2
            # (25 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.web_apps.module.etl_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "NODE_ENV"                                        = "production"
          - "NODE_ENVIRONMENT"                                = "production" -> null
          + "PDV_TOKENIZER_API_KEY"                           = "@Microsoft.KeyVault(VaultName=io-p-kv-common;SecretName=func-elt-PDV-TOKENIZER-API-KEY)"
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-etl-func-01"
        name                                           = "io-p-itn-com-etl-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.redis_messages.azurerm_redis_cache.this,
  on .terraform/modules/redis_messages/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and 7 more similar warnings elsewhere)

Error: invalid value for scope (Subscription scope is invalid)

  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"


Error: Cannot parse Azure ID: parse "iopstapi/blobServices/default/containers/message-content": invalid URI for request

  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"


Error: parsing "iopstapi/blobServices/default/containers/message-content": parsing segment "providers": parsing the ManagementGroup ID: the segment at position 0 didn't match

Expected a ManagementGroup ID that matched:

> /providers/Microsoft.Management/managementGroups/groupIdValue

However this value was provided:

> iopstapi/blobServices/default/containers/message-content

The parsed Resource ID was missing a value for the segment at position 0
(which should be the literal value "providers").



  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"


Error: parsing "iopstapi/blobServices/default/containers/message-content": parsing segment "subscriptions": parsing the Subscription ID: the segment at position 0 didn't match

Expected a Subscription ID that matched:

> /subscriptions/12345678-1234-9876-4563-123456789012

However this value was provided:

> iopstapi/blobServices/default/containers/message-content

The parsed Resource ID was missing a value for the segment at position 0
(which should be the literal value "subscriptions").



  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"


Error: parsing "iopstapi/blobServices/default/containers/message-content": parsing segment "subscriptions": parsing the ResourceGroup ID: the segment at position 0 didn't match

Expected a ResourceGroup ID that matched:

> /subscriptions/12345678-1234-9876-4563-123456789012/resourceGroups/example-resource-group

However this value was provided:

> iopstapi/blobServices/default/containers/message-content

The parsed Resource ID was missing a value for the segment at position 0
(which should be the literal value "subscriptions").



  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"


Error: Can not parse "scope" as a resource id: Cannot parse Azure ID: parse "iopstapi/blobServices/default/containers/message-content": invalid URI for request

  with module.web_apps.azurerm_role_assignment.message_content_container_read,
  on ../_modules/web_apps/etl_func.tf line 54, in resource "azurerm_role_assignment" "message_content_container_read":
  54:   scope                = "${var.messages_storage_account.name}/blobServices/default/containers/${var.messages_content_container.name}"

::error::Terraform exited with code 1.
```

</details>
